IRP/src/Documents/ProductionPlanningClosing/ProductionPlanningClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionPlanningClosing</name>
  <registerRecords>AccumulationRegister.R7020T_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R7030T_ProductionPlanning</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionPlanning</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R7030T_ProductionPlanning/R7030T_ProductionPlanning.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R7030T_ProductionPlanning</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningDocument</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningType</name>
    <type>
      <types>EnumRef.ProductionPlanningTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.MF_PlanningPeriods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ProductionType</name>
    <type>
      <types>EnumRef.ProductionTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BillOfMaterials</name>
    <type>
      <types>CatalogRef.MF_BillOfMaterials</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R7020T_MaterialPlanning/R7020T_MaterialPlanning.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R7020T_MaterialPlanning</name>
 <registerType>Turnovers</registerType>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PlanningDocument</name>
  <type>
   <types>DocumentRef.ProductionPlanning</types>
  </type>
 </dimensions>
 <dimensions>
  <name>BusinessUnit</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Production</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PlanningType</name>
  <type>
   <types>EnumRef.ProductionPlanningTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PlanningPeriod</name>
  <type>
   <types>CatalogRef.PlanningPeriods</types>
  </type>
 </dimensions>
 <dimensions>
  <name>BillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/ProductionPlanningTypes/ProductionPlanningTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ProductionPlanningTypes</name>
 <enumValues>
  <name>Planned</name>
 </enumValues>
 <enumValues>
  <name>Produced</name>
 </enumValues>
 <enumValues>
  <name>PlanAdjustment</name>
 </enumValues>
 <enumValues>
  <name>Closing</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/ProductionPlanningClosing/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Return Tables;	
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref, True);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters, True);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Tables = PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	Return;
EndProcedure

#EndRegion

#Region PostingInfo

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure();
	StrParams.Insert("Ref"                , Ref);
	StrParams.Insert("Company"            , Ref.Company);
	StrParams.Insert("BusinessUnit"       , Ref.BusinessUnit);
	StrParams.Insert("PlanningPeriod"     , Ref.ProductionPlanning.PlanningPeriod);
	StrParams.Insert("ProductionPlanning" , Ref.ProductionPlanning);
	StrParams.Insert("Period"             , Ref.Date);
	If Not Ref.isEmpty() Then
		StrParams.Insert("BalancePeriod"      , New Boundary(Ref.PointInTime(), BoundaryType.Excluding));
	EndIf;
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	Return QueryArray;	
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(R7030T_ProductionPlanning());
	QueryArray.Add(R7020T_MaterialPlanning());
	Return QueryArray;	
EndFunction	

Function R7030T_ProductionPlanning()
	Return
		"SELECT
		|	&Period AS Period,
		|	ProductionPlanning.Company AS Company,
		|	ProductionPlanning.BusinessUnit AS BusinessUnit,
		|	ProductionPlanning.Store AS Store,
		|	ProductionPlanning.ItemKey AS ItemKey,
		|	VALUE(Enum.ProductionPlanningTypes.Closing) AS PlanningType,
		|	ProductionPlanning.PlanningPeriod AS PlanningPeriod,
		|	ProductionPlanning.ProductionType AS ProductionType,
		|	ProductionPlanning.BillOfMaterials AS BillOfMaterials,
		|	ProductionPlanning.PlanningDocument AS PlanningDocument,
		|	-SUM(CASE
		|		WHEN ProductionPlanning.PlanningType = VALUE(Enum.ProductionPlanningTypes.Produced)
		|			THEN -ProductionPlanning.QuantityTurnover
		|		ELSE ProductionPlanning.QuantityTurnover
		|	END) AS Quantity
		|INTO R7030T_ProductionPlanning
		|FROM
		|	AccumulationRegister.R7030T_ProductionPlanning.Turnovers(,,, Company = &Company
		|	AND PlanningDocument = &ProductionPlanning
		|	AND PlanningPeriod = &PlanningPeriod
		|	AND PlanningType <> VALUE(Enum.ProductionPlanningTypes.Closing)) AS ProductionPlanning
		|GROUP BY
		|	ProductionPlanning.Company,
		|	ProductionPlanning.BusinessUnit,
		|	ProductionPlanning.Store,
		|	ProductionPlanning.ItemKey,
		|	ProductionPlanning.PlanningPeriod,
		|	ProductionPlanning.PlanningDocument,
		|	ProductionPlanning.ProductionType,
		|	ProductionPlanning.BillOfMaterials,
		|	VALUE(Enum.ProductionPlanningTypes.Closing)";
EndFunction

Function R7020T_MaterialPlanning()
	Return
		"SELECT
		|	&Period AS Period,
		|	MaterialPlanning.Company AS Company,
		|	MaterialPlanning.BusinessUnit AS BusinessUnit,
		|	MaterialPlanning.Store AS Store,
		|	MaterialPlanning.Production AS Production,
		|	MaterialPlanning.ItemKey AS ItemKey,
		|	VALUE(Enum.ProductionPlanningTypes.Closing) AS PlanningType,
		|	MaterialPlanning.PlanningPeriod AS PlanningPeriod,
		|	MaterialPlanning.BillOfMaterials AS BillOfMaterials,
		|	MaterialPlanning.PlanningDocument AS PlanningDocument,
		|	-SUM(CASE
		|		WHEN MaterialPlanning.PlanningType = VALUE(Enum.ProductionPlanningTypes.Produced)
		|			THEN -MaterialPlanning.QuantityTurnover
		|		ELSE MaterialPlanning.QuantityTurnover
		|	END) AS Quantity
		|INTO R7020T_MaterialPlanning
		|FROM
		|	AccumulationRegister.R7020T_MaterialPlanning.Turnovers(,,, Company = &Company
		|	AND PlanningDocument = &ProductionPlanning
		|	AND PlanningPeriod = &PlanningPeriod
		|	AND PlanningType <> VALUE(Enum.ProductionPlanningTypes.Closing)) AS MaterialPlanning
		|GROUP BY
		|	MaterialPlanning.Company,
		|	MaterialPlanning.BusinessUnit,
		|	MaterialPlanning.Store,
		|	MaterialPlanning.Production,
		|	MaterialPlanning.PlanningDocument,
		|	MaterialPlanning.ItemKey,
		|	MaterialPlanning.PlanningPeriod,
		|	MaterialPlanning.BillOfMaterials,
		|	VALUE(Enum.ProductionPlanningTypes.Closing)"
EndFunction

#EndRegion
